<template>
    <div class="terms-of-service container my-4">
      <h1 class="text-center mb-4">Условия использования</h1>
      <p>
        Добро пожаловать на наш сайт. Пожалуйста, внимательно ознакомьтесь с настоящими Условиями использования перед использованием нашего сайта. Используя наш сайт, вы соглашаетесь с этими условиями.
      </p>
  
      <h2>1. Принятие условий</h2>
      <p>
        Используя наш сайт, вы подтверждаете, что принимаете и соглашаетесь с настоящими Условиями использования. Если вы не согласны, пожалуйста, прекратите использование нашего сайта.
      </p>
  
      <h2>2. Изменения условий</h2>
      <p>
        Мы оставляем за собой право изменять настоящие Условия использования в любое время. Обновления будут размещены на этой странице. Продолжение использования сайта после любых изменений означает ваше согласие с новыми условиями.
      </p>
  
      <h2>3. Использование сайта</h2>
      <p>
        Вы соглашаетесь использовать сайт в соответствии с законодательством и не нарушать права других лиц. Запрещается использовать сайт для распространения вредоносного контента или дезинформации.
      </p>
  
      <h2>4. Интеллектуальная собственность</h2>
      <p>
        Весь контент на сайте, включая текст, изображения, логотипы и программное обеспечение, является нашей собственностью или собственностью наших партнеров и защищен авторским правом и другими законами. Вы не можете использовать этот контент без нашего предварительного письменного согласия.
      </p>
  
      <h2>5. Ограничение ответственности</h2>
      <p>
        Мы не несем ответственности за любые убытки или ущерб, возникающие в результате использования или невозможности использования сайта. Мы не гарантируем точность или полноту информации на сайте.
      </p>
  
      <h2>6. Внешние ссылки</h2>
      <p>
        На нашем сайте могут быть ссылки на внешние ресурсы. Мы не несем ответственности за контент или политику конфиденциальности этих сайтов. Использование этих ресурсов осуществляется на ваш собственный риск.
      </p>
  
      <h2>7. Прекращение использования</h2>
      <p>
        Мы оставляем за собой право прекратить или ограничить ваш доступ к сайту в любое время без предварительного уведомления, если вы нарушаете настоящие Условия использования.
      </p>
  
      <h2>8. Применимое право</h2>
      <p>
        Настоящие Условия использования регулируются законодательством [вашей страны]. Все споры, связанные с сайтом, будут решаться в компетентных судах [вашей страны].
      </p>
  
      <h2>9. Контактная информация</h2>
      <p>
        Если у вас есть вопросы или комментарии по поводу настоящих Условий использования, пожалуйста, свяжитесь с нами по адресу: <a href="mailto:4VROBOT.com">fourvrobot.com</a>.
      </p>
    </div>
  </template>
  
  <script>
  export default {
    name: "TermsOfService",
  };
  </script>
  
  <style scoped>
  .terms-of-service {
    /* background-color: #f8f9fa; */
    /* padding: 30px; */
    /* border-radius: 8px;
    box-shadow: 0 4px 8px rgba(0, 0, 0, 0.1); */
  }
  
  h1, h2 {
    /* color: #333; */
    margin-bottom: 20px;
  }
  
  p, ul {
    line-height: 1.8;
    /* color: #555; */
  }
  
  a {
    color: #007bff;
    text-decoration: none;
  }
  
  a:hover {
    text-decoration: underline;
  }
  </style>
  